app/Models/M_user.php

    public function get_data($username, $password)
	{
      return $this->db->table('user')
      ->where(array('username' => $username, 'user_pass' => $password))
      ->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `user_pass` = 'd033e22ae348aeb5660fc2140aec35850c4da997'